In [1]:
import pandas as pd

data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}

df = pd.DataFrame(data)
print(df)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [90]:
df["Name"] # Single column (as Series)

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [92]:
df[["Name", "City"]]   #Multiple columns (as DataFrame)

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

In [109]:
df.loc[0]    # First row (by label)

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [117]:
df.iloc[0]       # By Position

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [119]:
df.loc[[0,3]]

    Name  Age      City  Salary
0   John   28  New York   65000
3  Linda   42    London   85000

In [103]:
df.iloc[3]      #(by position)

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

In [115]:
df.loc[1, "Salary"]

70000

In [113]:
df.iloc[1,3]

70000

In [125]:
df.loc[0:2,["Name", "Salary"]]

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000

In [131]:
df.iloc[0:3, [0,3]]

    Name  Salary
0   John   65000
1   Anna   70000
2  Peter   62000

In [78]:
df.at[0, "Name"]       # Fast label-based access
#

'John'

In [76]:
df.iat[0, 1]           # Fast position-based access

28

In [82]:
df["Name"][0]

'John'

In [86]:
df["Name"][3]

'Linda'

### Creating NEw Columns

In [31]:
df["designation"] = ["Doc", "Eng", "Doc", "Eng"]
df

    Name  Age      City  Salary designation
0   John   28  New York   65000         Doc
1   Anna   34     Paris   70000         Eng
2  Peter   29    Berlin   62000         Doc
3  Linda   42    London   85000         Eng

### Drop/ Remove a column

In [34]:
df.drop('designation', axis = 1)

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [36]:
df

    Name  Age      City  Salary designation
0   John   28  New York   65000         Doc
1   Anna   34     Paris   70000         Eng
2  Peter   29    Berlin   62000         Doc
3  Linda   42    London   85000         Eng

## Deleting Column from MAin TABLE/ Server Permanently

In [39]:
df.drop('designation', axis = 1, inplace = True)

In [41]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## Selecting Subset of Rows and Columns

In [46]:
df.loc[[0,1]][["Name", "Salary"]]

   Name  Salary
0  John   65000
1  Anna   70000

In [48]:
df.loc[[2,3]][["Name", "Age"]]

    Name  Age
2  Peter   29
3  Linda   42

## Conditional Selection

In [56]:
df[df["Age"]>30]
# Those whose Age is GREATER THAN 30

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [133]:
df[df["Age"]>30]["Name"]

1     Anna
3    Linda
Name: Name, dtype: object

In [68]:
df[(df["Age"]>30) & (df['City'] == "Paris")]   #AND
# Those with age > 30 AND City is Paris

   Name  Age   City  Salary
1  Anna   34  Paris   70000

In [72]:
df[(df["Age"]>30) | (df['City'] == "Paris")]   # OR
# Those with Age > 30 or Live in PAris

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [88]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

## QUERY

In [138]:
df.query("Name == 'Anna'")

   Name  Age   City  Salary
1  Anna   34  Paris   70000

In [146]:
df.query(f"{'City'} == 'London'")

    Name  Age    City  Salary
3  Linda   42  London   85000

In [148]:
col = "Age"
df.query(f"{col} >= 25")

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000